In [77]:
import pandas as pd
import numpy as np

In [78]:
cf=pd.read_csv("gender_submission.csv")

In [79]:
d=cf.isnull()

In [80]:
for i in d.columns.values.tolist():
    print(d[i].value_counts())

False    418
Name: PassengerId, dtype: int64
False    418
Name: Survived, dtype: int64

In [81]:
len(cf)

418

In [82]:
df=pd.read_csv("test.csv")

In [83]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [84]:
n=df.isnull()

In [85]:
n=df.isnull()
for i in n.columns.values.tolist():
    print(n[i].value_counts())
    print("\n")

False    418
Name: PassengerId, dtype: int64


False    418
Name: Pclass, dtype: int64


False    418
Name: Name, dtype: int64


False    418
Name: Sex, dtype: int64


False    332
True      86
Name: Age, dtype: int64


False    418
Name: SibSp, dtype: int64


False    418
Name: Parch, dtype: int64


False    418
Name: Ticket, dtype: int64


False    417
True       1
Name: Fare, dtype: int64


True     327
False     91
Name: Cabin, dtype: int64


False    418
Name: Embarked, dtype: int64

In [86]:
df.drop(["Cabin"],axis=1,inplace=True)

In [87]:
len(df)

418

In [88]:
df=pd.merge(df,cf,on=["PassengerId"])

In [94]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S,1

In [90]:
avgma=df[df["Sex"]=="male"].Age.mean()

In [91]:
avgwa=df[df["Sex"]=="female"].Age.mean()

In [92]:
mf=df[df["Sex"]=="male"]

wf

In [112]:

wf.loc[:,["Age"]].replace(np.nan,avgwa)

      Age
1    47.0
4    22.0
6    30.0
8    18.0
12   23.0
..    ...
409   3.0
410   NaN
411  37.0
412  28.0
414  39.0

[152 rows x 1 columns]

In [106]:
np.NaN

nan

In [95]:
len(mf)

266

In [109]:
wf

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S,1
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,Q,1
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,C,1
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,S,1
...,...,...,...,...,...,...,...,...,...,...,...
409,1301,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,S,1
410,1302,3,"Naughton, Miss. Hannah",female,NaN,0,0,365237,7.7500,Q,1
411,1303,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,Q,1
412,1304,3,"Henriksson, Miss. Jenny Lovisa",female,28.0,0,0,347086,7.7750,S,1
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C,1

In [48]:
wf

Empty DataFrame
Columns: [PassengerId, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Embarked, Survived]
Index: []

In [96]:
wf=df[df["Sex"]=="female"]

In [116]:
wf["Age"].replace(np.nan,34.0)

1      47.0
4      22.0
6      30.0
8      18.0
12     23.0
       ...
409     3.0
410    34.0
411    37.0
412    28.0
414    39.0
Name: Age, Length: 152, dtype: float64

In [115]:
wf.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
Survived         int64
dtype: object